{
    "articles": [
        {
        "id": "1",
        "author": "Jason R. Wilson",
        "title": "EVGA Replaces RTX 3090 GPUs Bricked During Amazon’s New World Beta Period, Game Exposes Design Flaws on Various Cards - Wccftech",
        "description": "As you remember from an article from two days ago, Igor Wallossek from Igor's Lab pointed to a design flaw in EVGA's RTX 3090 card that was causing the GPU to be pushed extensively while playing Amazon's New World game, and essentially bricking the card. EVGA…",
        "url": "https://wccftech.com/evga-replaces-rtx-3090-gpus-bricked-during-amazons-new-world-beta-period-game-exposes-design-flaws-on-various-cards/",
        "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2021/07/New-World-Key-Art-scaled.jpg",
        "publishedAt": "2021-07-25T12:24:39Z",
        "content": "As you remember from an article from two days ago, Igor Wallossek from Igor's Lab pointed to a design flaw in EVGA's RTX 3090 card that was causing the GPU to be pushed extensively while playing Amaz… [+2524 chars]"
      },
      {
        "id": "2",
        "author": "Bogdan Popa",
        "title": "Google Secretly Working on New Waze Car Icons - autoevolution",
        "description": "Waze already comes with a pre-loaded collection of car icons, but every once in a while, the Google-owned company releases limited-time packs that allow users to customize their rides with special designs.",
        "url": "https://www.autoevolution.com/news/google-secretly-working-on-new-waze-car-icons-165925.html",
        "urlToImage": "https://s1.cdn.autoevolution.com/images/news/google-secretly-working-on-new-waze-car-icons-165925_1.jpg",
        "publishedAt": "2021-07-25T12:01:00Z",
        "content": "A future update is expected to include at least two new car icons that seem to be borrowed from the upcoming Halo Infinite, according to a recent teardown from 9to5Google.More specifically, the lates… [+1454 chars]"
      },
      {
        "id": "3",
        "author": null,
        "title": "The magazine of personal technology - Gadget",
        "description": "This week’s EA Play event held many significant gaming announcements. We’ve wrapped up five highlights from build-up and the main 40-minute event.",
        "url": "https://gadget.co.za/ea-play-live-in-review/",
        "urlToImage": "https://i0.wp.com/gadget.co.za/wp-content/uploads/2021/07/maxresdefault.jpg?resize=1000%2C600&ssl=1",
        "publishedAt": "2021-07-25T10:06:28Z",
        "content": "This years EA Play Live was too much to contain in a single event, so the game developers held four events before the main event. This helped each game announcement hold its own limelight for a littl… [+3404 chars]"
      },
      {
        "id": "4",
        "author": "IANS",
        "title": "New crypto malware targeting Windows, Linux systems: Microsoft - Times Now",
        "description": "The malware can quickly take advantage of news, events, or the release of new exploits to run effective campaigns.",
        "url": "https://www.timesnownews.com/technology-science/article/new-crypto-malware-targeting-windows-linux-systems-microsoft/789988",
        "urlToImage": "https://imgk.timesnownews.com/story/Microsoft_IANS_23_1.jpg?tr=w-560,h-292,fo-top",
        "publishedAt": "2021-07-25T08:59:52Z",
        "content": "New Delhi: Microsoft has warned customers about a new crypto mining malware that can steal credentials, remove security controls, spread via emails and ultimately drop more tools for human-operated a… [+2980 chars]"
      },
      {
        "id": "5",
        "author": null,
        "title": "Google celebrates Day 2 of Tokyo Olympics with yet another Champion Island Games Doodle - India Today",
        "description": "Google celebrated Day 2 of the Tokyo Olympics 2020 with yet another doodle on Champion Island Games. The interactive anime games have been designed by Tokyo-based animation studio STUDIO4°C.",
        "url": "https://www.indiatoday.in/trending-news/story/google-celebrates-day-2-of-tokyo-olympics-with-yet-another-champion-island-games-doodle-1832365-2021-07-25",
        "urlToImage": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202107/google_doodle_0-647x363.png?pSaRfV8EzZOaqBDPxTJzq94XNZYuXPgA",
        "publishedAt": "2021-07-25T06:35:21Z",
        "content": null
      },
      {
        "id": "6",
        "author": null,
        "title": "Microsoft will be redesigning some system apps for Windows 11 - Moneycontrol",
        "description": "Microsoft's new Fluent Design language will feature prominently in Windows 11",
        "url": "https://www.moneycontrol.com/news/technology/microsoft-will-be-redesigning-some-system-apps-for-windows-11-7219501.html",
        "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/Windows-770x433.jpg",
        "publishedAt": "2021-07-25T06:24:20Z",
        "content": "Windows 11 will adopt Microsoft's Fluent Design language, which the company says will be a cleaner and more intuitive language that will offer consistency and smooth out the rough edges.\r\nThe goal is… [+1017 chars]"
      },
      {
        "id": "7",
        "author": "Jacob Oliva",
        "title": "GM Releases Images Of Four-Seat Chevy Corvette That Never Happened - Motor1 ",
        "description": "As America's sports car, a lot was known about the Chevy Corvette. But it's only now that we discovered that the C2 had a four-seat design that never happened.",
        "url": "https://www.motor1.com/news/522297/four-seat-chevy-corvette-images/",
        "urlToImage": "https://cdn.motor1.com/images/mgl/WBoR6/s1/four-seat-chevy-corvette-c2.jpg",
        "publishedAt": "2021-07-25T06:22:00Z",
        "content": "Being as iconic as to bear the monicker America's sports car, we all know a thing or two about the Chevrolet Corvette. Its almost seven decades of existence warrant some facts to be known and today w… [+1614 chars]"
      },
      {
        "id": "8",
        "author": "Jim Vejvoda",
        "title": "Liu Kang Is \"The Heart and Engine\" of Mortal Kombat Legends: Battle of the Realms - Comic-Con 2021 - IGN - IGN",
        "description": "The filmmakers behind Mortal Kombat Legends: Battle of the Realms explained why Liu Kang is “the heart and engine” of the animated sequel during their Comic-Con@Home panel.",
        "url": "https://www.ign.com/articles/mortal-kombat-legends-battle-of-the-realms-liu-kang-ed-boon",
        "urlToImage": "https://assets-prd.ignimgs.com/2021/07/25/mkl-2-liu-kang-1280-1627173460457.jpg?width=1280",
        "publishedAt": "2021-07-25T00:47:16Z",
        "content": "The cast and filmmakers of the upcoming feature-length animated film Mortal Kombat Legends: Battle of the Realms assembled for a panel at Saturdays Comic-Con@Home\r\n where the filmmakers explained why… [+3057 chars]"
      },
      {
        "id": "9",
        "author": null,
        "title": "Some Microsoft apps are getting a new design for Windows 11 - WindowsLatest",
        "description": "At this point, we’ve already heard plenty about what Windows 11 and the new Microsoft Store are going to bring with them. Windows 11 brings a new interface to Start Menu, Action Center, and more. As expected, several apps developed by Microsoft are also getti…",
        "url": "https://www.windowslatest.com/2021/07/25/some-microsoft-apps-are-getting-a-new-design-for-windows-11/",
        "urlToImage": "https://www.windowslatest.com/wp-content/uploads/2021/07/Windows-11-apps-redesign.jpg",
        "publishedAt": "2021-07-24T23:17:04Z",
        "content": "At this point, we’ve already heard plenty about what Windows 11 and the new Microsoft Store are going to bring with them. Windows 11 brings a new interface to Start Menu, Action Center, and more. As … [+2378 chars]"
      },
      {
        "id": "10",
        "author": "Vaidyanathan Subramaniam",
        "title": "NVIDIA Lovelace to feature in next gen Nintendo Switch, Lovelace RTX 40 with 2.2 GHz+ boost being prepped to outship AMD RDNA 3 at a lesser price irrespective of performance - Notebookcheck.net",
        "description": "NVIDIA's Lovelace RTX 40 GPU design has apparently been finalized according to a new leak. Lovelace is also likely to feature in the upcoming Nintendo \"Super Switch\" and could be a part of NVIDIA's Orin self-driving SoC systems. It looks like NVIDIA is planni…",
        "url": "https://www.notebookcheck.net/NVIDIA-Lovelace-to-feature-in-next-gen-Nintendo-Switch-Lovelace-RTX-40-with-2-2-GHz-boost-being-prepped-to-outship-AMD-RDNA-3-at-a-lesser-price-irrespective-of-performance.551978.0.html",
        "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/nintendo_switch_lovelace_rdna_3.png",
        "publishedAt": "2021-07-24T22:16:39Z",
        "content": "Recently, we've come across information that NVIDIA's upcoming Hopper architecture is would be taping out soon for a mid-2022 launch. While Hopper is meant to cater to datacenter and AI workflows, Ad… [+2779 chars]"
      }
    ]
}