{
  "status": "ok",
  "totalResults": 1000,
  "articles": [
    {
        "id": "1",
        "author": "Vanshika Malhotra",
        "title": "Expected launches in the coming week: Nothing Ear 1, Poco X3 GT and more - BGR India",
        "description": "It's a new week in tech and we are expected to see a number of new products being launched across a number of categories. If you are interested, here's a look at the top expected launches that will take place in the coming week.",
        "url": "https://www.bgr.in/photo-gallery/top-launches-in-the-coming-week-nothing-ear-1-poco-x3-gt-and-more-974923/",
        "urlToImage": "https://st1.bgr.in/wp-content/uploads/2021/07/ear-1.jpg",
        "publishedAt": "2021-07-25T14:29:32Z",
        "content": "Nothing Ear 1\r\nNothing is all set to launch its first-ever earbuds on July 27. While not all details are revealed, it will come with ANC, a 24-hour battery life, fast charging, a transparent design, … [+38 chars]"
      },
      {
        "id": "2",
        "author": "Rollin Bishop",
        "title": "FIFA 22 Announces First English-Speaking Female Commentator - ComicBook.com",
        "description": "EA has announced this week that former soccer star Alex Scott will officially be a goal commentator in the upcoming video game FIFA 22, which is set to release for PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, Nintendo Switch, Google Stadia, and PC…",
        "url": "https://comicbook.com/gaming/news/fifa-22-alex-scott-first-female-commentator/",
        "urlToImage": "https://media.comicbook.com/2021/07/fifa-22-alex-scott-new-cropped-hed-1276918-1280x0.jpeg",
        "publishedAt": "2021-07-25T14:19:00Z",
        "content": "EA has announced this week that former soccer star Alex Scott will officially be a goal commentator in the upcoming video game FIFA 22, which is set to release for PlayStation 5, PlayStation 4, Xbox … [+2230 chars]"
      },
      {
        "id": "3",
        "author": "Nathaniel Mott",
        "title": "Oculus Experiments With Mixed Reality via New Passthrough API - PCMag",
        "description": "Oculus introduced a new Passthrough API to enable developers to create mixed reality experiences for the Quest 2 headset.",
        "url": "https://www.pcmag.com/news/oculus-experiments-with-mixed-reality-via-new-passthrough-api",
        "urlToImage": "https://i.pcmag.com/imagery/articles/01HqCh8Mf1QiMFh9auzqjlJ-1.1627222284.fit_lim.size_1200x630.jpg",
        "publishedAt": "2021-07-25T14:13:57Z",
        "content": "Oculus revealed a new Passthrough API that will allow developers to create mixed reality experiences for the Quest 2 headset. The experimental technology is expected to arrive in an update to the sof… [+2442 chars]"
      },
      {
        "id": "5",
        "author": "Vikki Blake",
        "title": "Motive's Dead Space remake may use content cut from the original game - Eurogamer.net",
        "description": null,
        "url": "https://www.eurogamer.net/articles/2021-07-25-motives-dead-space-remake-may-use-content-cut-from-the-original-game",
        "urlToImage": "https://d2skuhm0vrry40.cloudfront.net/2021/articles/2021-07-25-15-07/-1627222070708.jpg/EG11/resize/1200x-1/-1627222070708.jpg",
        "publishedAt": "2021-07-25T14:06:00Z",
        "content": "Motive's Dead Space remake will reportedly include content that had been cut from the original game.\r\nAccording to an IGN interview with creative director Roman Campos-Oriola, original developer Visc… [+1863 chars]"
      },
      {
        "id": "6",
        "author": null,
        "title": "Weekend poll: How important are Android's customization options to you? - Android Police",
        "description": "Customization has always set Android apart from other operating systems, going all the way back to its earliest days. Whether it's manufacturers crafting",
        "url": "https://www.androidpolice.com/2021/07/25/weekend-poll-how-important-are-androids-customization-options-to-you/",
        "urlToImage": "https://www.androidpolice.com/wp-content/uploads/2021/05/21/Android-12-lockscreen-vs-Android-11-scaled.jpg",
        "publishedAt": "2021-07-25T14:03:00Z",
        "content": "Customization has always set Android apart from other operating systems, going all the way back to its earliest days. Whether it's manufacturers crafting unique (and usually bad) skins or power users… [+1763 chars]"
      },
      {
        "id": "7",
        "author": "Giuseppe Nelva",
        "title": "Microsoft Flight Simulator - Orbx Showcases Add-Ons for Xbox Series X|S With Gorgeous Trailer - Twinfinite",
        "description": "Prolific add-on developer Orbx revealed a new trailer related to the upcoming release of Microsoft Flight Simulator for Xbox Series X|S.",
        "url": "https://twinfinite.net/2021/07/microsoft-flight-simulator-orbx-showcases-add-ons-for-xbox-series-xs-with-gorgeous-trailer/",
        "urlToImage": "https://twinfinite.net/wp-content/uploads/2021/07/Microsoft-Flight-Simulator-Orbx.jpg",
        "publishedAt": "2021-07-25T14:01:54Z",
        "content": "Today prolific add-on developer Orbx revealed a new trailer related to the upcoming release of Microsoft Flight Simulator for Xbox Series X|S. \r\nOne of the elements that may surprise the new virtual … [+2609 chars]"
      },
      {
        "id": "8",
        "author": "Hayes Madsen",
        "title": "Swords of Legends Online Announces First Battle Pass and Summer Events - CGMagazine",
        "description": "Gameforge has detailed the first Battle Pass for Swords of Legends Online, as well as the Summer Event.",
        "url": "https://www.cgmagonline.com/2021/07/25/swords-of-legends-online-announces-first-battle-pass-and-summer-events/",
        "urlToImage": "https://cdn.cgmagonline.com/wp-content/uploads/2021/07/news-swords-of-legends-online-announces-first-battle-pass-and-summer-events.jpg",
        "publishedAt": "2021-07-25T14:00:24Z",
        "content": "Swords of Legends Online is the Chinese mythology-inspired MMORPG that launched earlier in July, and with the game now out in the wild in the West it’s starting to receive a slew of post-launch updat… [+3057 chars]"
      },
      {
        "id": "9",
        "author": "Zarmeen Shahzad",
        "title": "Pixlr Premium 1-Yr Subscription Is Up For A Massive Discount Offer For A Few Days – Avail Now - Wccftech",
        "description": "You can take your photo editing skills to the next level and use better tools to create better images. Wccftech will help you with this, and we are offering a limited-time discount offer on the Pixlr Premium 1-Yr Subscription. The discount offer will expire i…",
        "url": "https://wccftech.com/how-to/pixlr-premium-1-yr-subscription-discount/",
        "urlToImage": "https://cdn.wccftech.com/wp-content/uploads/2021/07/Pixlr-Premium-1-Yr-Subscription.jpg",
        "publishedAt": "2021-07-25T13:59:45Z",
        "content": "You can take your photo editing skills to the next level and use better tools to create better images. Wccftech will help you with this, and we are offering a limited-time discount offer on the Pixlr… [+2031 chars]"
      },
      {
        "id": "10",
        "author": "Matthew Liebl",
        "title": "Is The Ascent coming to PS5 or PS4? - App Trigger",
        "description": "The Ascent is set to release this week on July 29, 2021. The debut title from Neon Giant is an intriguing top-down, twin-stick shooter set in a futuristic ...",
        "url": "https://apptrigger.com/2021/07/25/ascent-ps5-ps4/",
        "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fapptrigger.com%2Ffiles%2F2021%2F06%2FThe-Ascent-2.jpg",
        "publishedAt": "2021-07-25T13:59:00Z",
        "content": "The Ascent is set to release this week on July 29, 2021. The debut title from Neon Giant is an intriguing top-down, twin-stick shooter set in a futuristic dystopian world.\r\nIt’s a game I’ve had on my… [+1689 chars]"
      },
      {
        "id": "11",
        "author": "HT Tech",
        "title": "Leaked! iPhone 13 could be the fastest charging Apple handset ever, faster than even iPhone 12; Android shamed? - HT Tech",
        "description": "It looks like the Apple iPhone 13 is going to charge at a faster rate than any other previous iPhone, according to a new rumour. It has put Android phones have under spotlight.",
        "url": "https://tech.hindustantimes.com/mobile/news/leaked-iphone-13-could-be-the-fastest-charging-apple-handset-ever-faster-than-even-iphone-12-android-shamed-71627221213461.html",
        "urlToImage": "https://images.hindustantimes.com/tech/img/2021/07/25/1600x900/E5bLEPsUcAQtWNi_1625654783566_1627221376207.jpeg",
        "publishedAt": "2021-07-25T13:53:33Z",
        "content": "Apple iPhone 13 is one of the most anticipated high-end devices of the year due to the splendid specs that it may be packing. Recent leaks have suggested the company could launch its upcoming smartph… [+1827 chars]"
      },
      {
        "id": "12",
        "author": "Deirdre O&#039;Donnell",
        "title": "Leaked MediaTek Dimensity 1300T specs point to a new Snapdragon 865-beating chipset with an imminent launch - Notebookcheck.net",
        "description": "MediaTek is now rumored to have a new 5G Dimensity chipset ready to go. More detailed specs for this putative 1300T are now allegedly out there, including a 6 nanometer (nm) architecture and an ARM Cortex-A78 core, a combination that might easily rival Qualco…",
        "url": "https://www.notebookcheck.net/Leaked-MediaTek-Dimensity-1300T-specs-point-to-a-new-Snapdragon-865-beating-chipset-with-an-imminent-launch.552253.0.html",
        "urlToImage": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc3/JsoHxNujTacHEYT4WPXJE7_1200_80.png",
        "publishedAt": "2021-07-25T13:53:30Z",
        "content": "MediaTek is now linked to a closely-impending launch for the Dimensity 1300T, an alleged new SoC on which relatively little is known thus far. However, MyDrivers now claims to expand on this subject … [+1685 chars]"
      },
      {
        "id": "13",
        "author": null,
        "title": "Final Fantasy 16 Reveals New Development Update, YoshiP Comments Translated - DualShockers",
        "description": "New update on the voice acting and motion capture of Final Fantasy 16",
        "url": "https://www.dualshockers.com/final-fantasy-16-development-update-voices-yoship/",
        "urlToImage": "https://www.dualshockers.com/static/uploads/2021/07/Final-Fantasy-16-Yoshida-Naoki-new-voice-recording-comments-story-feature-Clive-Rosfield-protagonist-screenshot-scaled.jpg",
        "publishedAt": "2021-07-25T13:52:15Z",
        "content": "Final Fantasy 16 producer Naoki Yoshida revealed yet another update on the Square Enix JRPG and its development, this time on WasyaganaTV, the YouTube show hosted by popular seiyuu Yuichi Nakamura an… [+3527 chars]"
      },
      {
        "id": "14",
        "author": "Matthew Liebl",
        "title": "PS Plus games for August 2021 revealed prematurely on PlayStation website - App Trigger",
        "description": "We already know Hunter's Arena will be part of August's PlayStation Plus lineup but now it seems the PlayStation website has prematurely revealed the remai...",
        "url": "https://apptrigger.com/2021/07/25/ps-plus-games-august-revealed/",
        "urlToImage": "https://images2.minutemediacdn.com/image/fetch/w_2000,h_2000,c_fit/https%3A%2F%2Fapptrigger.com%2Fwp-content%2Fuploads%2Fgetty-images%2F2018%2F08%2F869378046.jpeg",
        "publishedAt": "2021-07-25T13:37:00Z",
        "content": "We already know Hunter’s Arena will be part of August’s PlayStation Plus lineup but now it seems the PlayStation website has prematurely revealed the remaining games coming for free next month. While… [+1595 chars]"
      },
      {
        "id": "15",
        "author": null,
        "title": "Sony files a third trademark update for ‘PlayStation Home’ - NME",
        "description": "Sony has filed its third trademark update for 'PlayStation Home' so far in 2021.",
        "url": "https://www.nme.com/news/gaming-news/sony-files-a-third-trademark-update-for-playstation-home-3002019",
        "urlToImage": "https://www.nme.com/wp-content/uploads/2021/07/PlayStation-home-screenshot-.jpg",
        "publishedAt": "2021-07-25T13:20:41Z",
        "content": "Sony has filed its third trademark update for PlayStation Home so far in 2021, sparking rumours the social space could make a comeback.\r\nSony updated the trademark earlier this week (July 21), adding… [+1864 chars]"
      } ]
}