{
    "status": "ok",
    "totalResults": 13064,
    "articles": [
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Neesha A. Tambe",
            "title": "Win $100,000: Apply to Startup Battlefield at TC Disrupt 2021",
            "description": "You’ve been hard at work building your game-changing startup. Diligent in its care and feeding so that, one day soon, it will grow into the mighty unicorn you envision. If you fit that description, we want you to apply to compete in the Startup Battlefield at…",
            "url": "http://techcrunch.com/2021/05/18/win-100000-apply-to-startup-battlefield-at-tc-disrupt-2021/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/04/battlefield-apply.jpg?w=711",
            "publishedAt": "2021-05-18T17:59:12Z",
            "content": "Youve been hard at work building your game-changing startup. Diligent in its care and feeding so that, one day soon, it will grow into the mighty unicorn you envision. If you fit that description, we… [+3155 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Marquise Foster",
            "title": "Startup Alley tickets are selling out in record numbers",
            "description": "Beware! There isn’t much time left to apply for Startup Alley. Take advantage of this opportunity before it’s too late. When you purchase a ticket for Startup Alley, you can opt into being considered for a spot in our inaugural Startup Alley+ cohort. This ver…",
            "url": "http://techcrunch.com/2021/06/02/startup-alley-tickets-are-selling-out-in-record-numbers/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/48835675366_fbb0027e0a_o.jpg?w=600",
            "publishedAt": "2021-06-02T19:13:00Z",
            "content": "Beware! There isn’t much time left to apply for Startup Alley. Take advantage of this opportunity before it’s too late.\r\nWhen you purchase a ticket for Startup Alley, you can opt into being considere… [+1757 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Neesha A. Tambe",
            "title": "Deadline extended: Apply to Startup Battlefield at TC Disrupt 2021",
            "description": "When you’re head-down and nose to the grindstone — I’m looking at all you hard-working early-stage startup founders — it’s easy to miss a deadline for an outstanding opportunity. Case in point: competing in Startup Battlefield at TechCrunch Disrupt 2021 in Se…",
            "url": "http://techcrunch.com/2021/05/14/deadline-extended-apply-to-startup-battlefield-at-tc-disrupt-2021/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/disrupt-battlefield-leo-aerospace-0691.jpg?w=581",
            "publishedAt": "2021-05-14T15:10:52Z",
            "content": "When youre head-down and nose to the grindstone Im looking at all you hard-working early-stage startup founders its easy to miss a deadline for an outstanding opportunity. Case in point: competing in… [+2582 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Ram Iyer",
            "title": "Advanced tax strategies for startup founders",
            "description": "Here are some advanced equity planning strategies that you can implement at different stages of your company life cycle to reduce tax and optimize wealth for you and your family.",
            "url": "http://techcrunch.com/2021/05/13/advanced-tax-strategies-for-startup-founders/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/GettyImages-528491602.jpg?w=600",
            "publishedAt": "2021-05-13T20:13:29Z",
            "content": "More posts by this contributor\r\nAs an entrepreneur, you started your business to create value, both in what you deliver to your customers and what you build for yourself. You have a lot going on, but… [+8939 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Ron Miller",
            "title": "Industrial automation startup Bright Machines hauls in $435M by going public via SPAC",
            "description": "After the transaction is consummated, the startup will sport an anticipated equity valuation of $1.6 billion.",
            "url": "http://techcrunch.com/2021/05/17/industrial-automation-startup-bright-machines-hauls-in-435m-by-going-public-via-spac/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/GettyImages-1273582733.jpg?w=600",
            "publishedAt": "2021-05-17T19:15:14Z",
            "content": "Bright Machines is going public via a SPAC-led combination, it announced this morning. The transaction will see the 3-year-old company merge with SCVX, raising gross cash proceeds of $435 million in … [+1774 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Ingrid Lunden",
            "title": "Styra, the startup behind Open Policy Agent, nabs $40M to expand its cloud-native authorization tools",
            "description": "As cloud-native apps continue to become increasingly central to how organizations operate, a startup founded by the creators of a popular open-source tool to manage authorization for cloud-native application environments is announcing some funding to expand i…",
            "url": "http://techcrunch.com/2021/05/18/styra-the-startup-behind-open-policy-agent-nabs-40m-to-expand-its-cloud-native-authorization-tools/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/01/GettyImages-813176546.jpg?w=599",
            "publishedAt": "2021-05-18T13:31:42Z",
            "content": "As cloud-native apps continue to become increasingly central to how organizations operate, a startup founded by the creators of a popular open-source tool to manage authorization for cloud-native app… [+2978 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Jordan Crook",
            "title": "Fintech startup Vise raises $65 million in Series C led by Ribbit Capital",
            "description": "Vise today announced a $65 million Series C financing round led by Ribbit Capital, with participation from existing investors including Sequoia. The startup launched on the Disrupt Startup Battlefield stage in 2019 and has since raised upwards of $125 million…",
            "url": "http://techcrunch.com/2021/05/18/fintech-startup-vise-raises-65-million-in-series-c-led-by-ribbit-capital/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/10/vise-ai-DSC03361.jpg?w=600",
            "publishedAt": "2021-05-18T14:10:44Z",
            "content": "Vise today announced a $65 million Series C financing round led by Ribbit Capital, with participation from existing investors including Sequoia.\r\nThe startup launched on the Disrupt Startup Battlefie… [+2420 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Romain Dillet",
            "title": "Finary wants to create the wealth management dashboard for the next generation",
            "description": "Meet Finary, a new French startup that wants to change how you manage your savings, investments, mortgage, real estate assets and cryptocurrencies. The company lets you aggregate all your accounts across various banks and financial institutions so that you ca…",
            "url": "http://techcrunch.com/2021/05/18/finary-wants-to-create-the-wealth-management-dashboard-for-the-next-generation/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/Finary-Plateforme-Web-2.png?w=533",
            "publishedAt": "2021-05-18T16:53:38Z",
            "content": "Meet Finary, a new French startup that wants to change how you manage your savings, investments, mortgage, real estate assets and cryptocurrencies. The company lets you aggregate all your accounts ac… [+3084 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Tage Kene-Okafor",
            "title": "Nigeria’s Mono raises millions to power the internet economy in Africa",
            "description": "In February, Nigerian fintech startup Mono announced its acceptance into Y Combinator and, at the time, it wanted to build the Plaid for Africa. Three months later, the startup has a different mission: to power the internet economy in Africa and has closed $2…",
            "url": "http://techcrunch.com/2021/05/24/nigerias-mono-raises-millions-to-power-the-internet-economy-in-africa/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/MIT01700-1.jpg?w=636",
            "publishedAt": "2021-05-24T08:03:02Z",
            "content": "In February, Nigerian fintech startup Mono announced its acceptance into Y Combinator and, at the time, it wanted to build the Plaid for Africa. Three months later, the startup has a different missio… [+5051 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Manish Singh",
            "title": "Indian logistics SaaS startup FarEye raises $100 million",
            "description": "FarEye, an Indian SaaS startup that helps firms globally optimize their supply chain and logistics operations, said on Tuesday it has raised a new financing round, its third since the pandemic broke last year, as it looks to further expand in international ma…",
            "url": "http://techcrunch.com/2021/05/25/indian-logistics-saas-startup-fareye-raises-100-million/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/GettyImages-654729951.jpg?w=599",
            "publishedAt": "2021-05-25T10:00:34Z",
            "content": "FarEye, an Indian SaaS startup that helps firms globally optimize their supply chain and logistics operations, said on Tuesday it has raised a new financing round, its third since the pandemic broke … [+4348 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Ron Miller",
            "title": "Unbounce snags Snazzy.ai to add automated copywriting to platform",
            "description": "Unbounce, a Vancouver startup best known for helping marketers create automated landing pages, added a new wrinkle this morning when it announced it has acquired Snazzy.ai, an early stage automated copywriting startup. The two companies did not share the term…",
            "url": "http://techcrunch.com/2021/05/19/unbounce-snags-snazzy-ai-to-add-automated-copywriting-to-platform/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/GettyImages-1032165070.jpg?w=554",
            "publishedAt": "2021-05-19T13:00:36Z",
            "content": "Unbounce, a Vancouver startup best known for helping marketers create automated landing pages, added a new wrinkle this morning when it announced it has acquired Snazzy.ai, an early stage automated c… [+2564 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Lucas Matney",
            "title": "Dapper Labs backs art hardware startup Infinite Objects in $6 million seed raise",
            "description": "The NFT world is all about reshaping the idea of digital ownership, but art hardware startup Infinite Objects sees a big opportunity in making physical copies of those assets as it looks to reshape digital art and collectibles. The startup makes screens that …",
            "url": "http://techcrunch.com/2021/05/27/dapper-labs-backs-art-hardware-startup-infinite-objects-in-6-million-seed-raise/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/Hero_Carousel_NatashaTomchin_DichroicDreams.jpg?w=706",
            "publishedAt": "2021-05-27T16:19:35Z",
            "content": "The NFT world is all about reshaping the idea of digital ownership, but art hardware startup Infinite Objects sees a big opportunity in making physical copies of those assets as it looks to reshape d… [+3587 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Devin Coldewey",
            "title": "OpenAI’s $100M startup fund will make ‘big early bets’ with Microsoft as partner",
            "description": "OpenAI is launching a $100 million startup fund, which it calls the OpenAI Startup Fund, though which it and its partners will invest in early-stage AI companies tackling major problems (and productivity). Among those partners and investors in the fund is Mic…",
            "url": "http://techcrunch.com/2021/05/26/openais-100m-startup-fund-will-make-big-early-bets-with-microsoft-as-partner/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2019/03/lp-logo-3.jpg?w=591",
            "publishedAt": "2021-05-26T17:22:01Z",
            "content": "OpenAI is launching a $100 million startup fund, which it calls the OpenAI Startup Fund, though which it and its partners will invest in early-stage AI companies tackling major problems (and producti… [+2114 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Manish Singh",
            "title": "Tata Digital to invest $75 million in CureFit",
            "description": "Tata Digital, a subsidiary of Indian conglomerate Tata Group, said on Monday it has signed a deal to invest up to $75 million in fitness startup CureFit. As part of the deal, CureFit co-founder and chief executive Mukesh Bansal will join Tata Digital as Presi…",
            "url": "http://techcrunch.com/2021/06/07/tata-digital-to-invest-75-million-in-curefit/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/07/curefit.jpg?w=681",
            "publishedAt": "2021-06-07T12:59:50Z",
            "content": "Tata Digital, a subsidiary of Indian conglomerate Tata Group, said on Monday it has signed a deal to invest up to $75 million in fitness startup CureFit. As part of the deal, CureFit co-founder and c… [+907 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Natasha Lomas",
            "title": "Security startup Tessian, which uses AI to fight social engineering, trousers $65M",
            "description": "In the latest chunky funding round out of Europe, UK-based email security startup, Tessian, has closed $65 million in Series C funding. The startup applies machine learning to build individual behavior models for enterprise email use that aims to combat human…",
            "url": "http://techcrunch.com/2021/05/25/security-startup-tessian-which-uses-ai-to-fight-social-engineering-trousers-65m/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/06/Tessian-Co-founders-L-R-Tim-Sadler-CEO_-Ed-Bishop-CTO_-Tom-Adams-Head-of-Client-side-engineering.jpg?w=600",
            "publishedAt": "2021-05-25T13:31:25Z",
            "content": "In the latest chunky funding round out of Europe, UK-based email security startup, Tessian, has closed $65 million in Series C funding. The startup applies machine learning to build individual behavi… [+2953 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Ingrid Lunden",
            "title": "Snap acquires AR startup WaveOptics, which provides tech for Spectacles, for over $500M",
            "description": "Snap yesterday announced the latest iteration of its Spectacles augmented reality glasses, and today the company revealed a bit more news: it is also acquiring the startup that supplied the technology that helps power them. The Snapchat parent is snapping up …",
            "url": "http://techcrunch.com/2021/05/21/snap-acquires-ar-startup-waveoptics-which-provides-tech-for-spectacles-for-over-500m/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/spectacles.jpg?w=764",
            "publishedAt": "2021-05-21T14:30:14Z",
            "content": "Snap yesterday announced the latest iteration of its Spectacles augmented reality glasses, and today the company revealed a bit more news: it is also acquiring the startup that supplied the technolog… [+2897 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Ingrid Lunden",
            "title": "Factory14 raises $200M to jump into the Amazon marketplace roll-up race",
            "description": "It doesn’t feel like a week goes by at the moment that another startup doesn’t emerge armed with a huge wallet of cash to pursue a strategy of consolidating and then scaling promising brands that have built a business selling on marketplaces like Amazon’s. In…",
            "url": "http://techcrunch.com/2021/05/20/factory14-raises-200m-to-jump-into-the-amazon-marketplace-roll-up-race/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/05/pro-bike-tool.jpg?w=600",
            "publishedAt": "2021-05-20T19:02:53Z",
            "content": "It doesn’t feel like a week goes by at the moment that another startup doesn’t emerge armed with a huge wallet of cash to pursue a strategy of consolidating and then scaling promising brands that hav… [+7898 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Mike Butcher",
            "title": "NUE Life Health raises $3.3M for its psychedelics-meets-tech mental wellness platform",
            "description": "NUE Life Health, a telemedine startup in the USA, is developing what it describes as a “next-generation mental wellness solution” employing treatments such as psychedelic-assisted therapies, combined with a graph database-driven app. The Miami-based startup h…",
            "url": "http://techcrunch.com/2021/06/03/nue-life-health-raises-3-3m-for-its-psychedelics-meets-tech-mental-wellness-platform/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2021/06/NUE-Life.jpg?w=604",
            "publishedAt": "2021-06-03T13:00:25Z",
            "content": "NUE Life Health, a telemedine startup in the USA, is developing what it describes as a next-generation mental wellness solution employing treatments such as psychedelic-assisted therapies, combined w… [+3010 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Manish Singh",
            "title": "Paytm, India’s most valuable startup, confirms plan for an IPO",
            "description": "Paytm, India’s most valuable startup, confirmed to its shareholders and employees on Monday that it plans to file for an IPO. In a letter to shareholders and employees, Paytm said that it plans to raise money by issuing fresh equity in the IPO, and also sell …",
            "url": "http://techcrunch.com/2021/06/07/paytm-ipo-shareholders/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2020/09/GettyImages-631364290.jpg?w=600",
            "publishedAt": "2021-06-07T16:23:23Z",
            "content": "Paytm, India’s most valuable startup, confirmed to its shareholders and employees on Monday that it plans to file for an IPO.\r\nIn a letter to shareholders and employees, Paytm said that it plans to r… [+1742 chars]"
        },
        {
            "source": {
                "id": "techcrunch",
                "name": "TechCrunch"
            },
            "author": "Neesha A. Tambe",
            "title": "36 hours left to apply to Startup Battlefield at TC Disrupt 2021",
            "description": "Do you and your early-stage startup have what it takes to be a modern-day gladiator and compete in Startup Battlefield at TechCrunch Disrupt 2021? You won’t know unless you apply, and time is running out. You have only 48 hours left to throw your helmet into …",
            "url": "http://techcrunch.com/2021/05/12/36-hours-left-to-apply-to-startup-battlefield-at-tc-disrupt-2021/",
            "urlToImage": "https://techcrunch.com/wp-content/uploads/2018/10/30671212518_01bb4c8a1d_o.jpg?w=601",
            "publishedAt": "2021-05-12T19:33:40Z",
            "content": "Do you and your early-stage startup have what it takes to be a modern-day gladiator and compete in Startup Battlefield at TechCrunch Disrupt 2021? You wont know unless you apply, and time is running … [+2031 chars]"
        }
    ]
}